---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Element..::..GetValidTypes Method
Element Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetValidTypes()()()() | Obtains a set of types that are valid for this element. |
|  | GetValidTypes(Document, ICollection<(Of <<'(ElementId>)>>)) | Obtains a set of types that are valid for all given elements. |

# See Also

Element Class

Element Members

Autodesk.Revit.DB Namespace